/**
 * Дан массив с целыми числами:
 * int[] arr = {1, 2, 3, 4, 5};
 * Найдите сумму элементов этого массива.
 */
public class LessonArraySum {

    public static void main(String[] args) {
        int[] arr = {1, 2, 3, 4, 5};
        int sum = arr[0] + arr[1] + arr[2] + arr[3] + arr[4];
        System.out.println(sum);
    }
}