/**
 * Дан массив с целыми числами:
 * int[] arr = {1, 2, 3, 4, 5};
 * Выведите в консоль элементы этого массива.
 */
import java.util.Arrays;

public class LessonArrayPrint {

    public static void main(String[] args) {

        int[] arr = {1, 2, 3, 4, 5};
        System.out.println(Arrays.toString(arr));
    }
}